In [1]:
import pandas as pd
from sqlalchemy import create_engine

## Store CSV int DataFrame

In [2]:
mls_2007 = "Resources/mls_salaries_2007.csv"
mls_07_data =pd.read_csv(mls_2007)
mls_07_data.head()

,id,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,1,CHI,Armas,Chris,M,225000.0,225000.0
1,2,CHI,Banner,Michael,M,12900.0,12900.0
2,3,CHI,Barrett,Chad,F,41212.5,48712.5
3,4,CHI,Blanco,Cuauhtemoc,F,2492316.0,2666778.0
4,5,CHI,Brown,C.J.,D,106391.0,106391.0

In [3]:
#checking the column names 

mls_07_data.columns

Index(['id', 'club', 'last_name', 'first_name', 'position', 'base_salary',
       'guaranteed_compensation'],
      dtype='object')

In [4]:
# Observe the missing data
null_data = mls_07_data[mls_07_data.isnull().any(axis=1)]
null_data

Empty DataFrame
Columns: [id, club, last_name, first_name, position, base_salary, guaranteed_compensation]
Index: []

In [5]:
# Checking the data types of the columns
mls_07_data.dtypes

id                           int64
club                        object
last_name                   object
first_name                  object
position                    object
base_salary                float64
guaranteed_compensation    float64
dtype: object

In [6]:
# Check the count
mls_07_data.count()

id                         371
club                       371
last_name                  371
first_name                 371
position                   371
base_salary                371
guaranteed_compensation    371
dtype: int64

In [7]:
# Find duplicate team names
mls_07_data['club'].unique()

array(['CHI', 'CHV', 'CLB', 'COL', 'DAL', 'DC', 'HOU', 'KC', 'LA', 'NE',
       'NY', 'Pool', 'RSL', 'TFC'], dtype=object)

# Cleaning the DataFrames

In [8]:
# Create a new set of data for the 2007 year with selected columns

mls_07_new_data = mls_07_data[['id', 'club', 'last_name', 'first_name']].copy()
mls_07_new_data.head()

   id club last_name  first_name
0   1  CHI     Armas       Chris
1   2  CHI    Banner     Michael
2   3  CHI   Barrett        Chad
3   4  CHI    Blanco  Cuauhtemoc
4   5  CHI     Brown        C.J.

## Store CSV int DataFrame

In [9]:
mls_2009 = "Resources/mls_salaries_2009.csv"
mls_09_data = pd.read_csv(mls_2009)
mls_09_data.head()

,id,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,1,NE,Albright,Chris,D,176000.0,176000.0
1,2,RSL,Alexandre,Jean,M,34000.0,34000.0
2,3,DC,Allen,Ely,F-M,15300.0,15300.0
3,4,SEA,Alonso,Osvaldo,M,65000.0,65000.0
4,5,NE,Alston,Kevin,D,55000.0,104000.0

In [10]:
# Observe the missing data
null_data = mls_09_data[mls_09_data.isnull().any(axis=1)]
null_data

Empty DataFrame
Columns: [id, club, last_name, first_name, position, base_salary, guaranteed_compensation]
Index: []

In [11]:
# Check the count
mls_09_data.count()

id                         388
club                       388
last_name                  388
first_name                 388
position                   388
base_salary                388
guaranteed_compensation    388
dtype: int64

In [12]:
mls_09_data['club'].unique()

array(['NE', 'RSL', 'DC', 'SEA', 'SJ', 'NY', 'KC', 'HOU', 'TFC', 'DAL',
       'COL', 'CHI', 'LA', 'Pool', 'CHV', 'CLB'], dtype=object)

# Cleaning the DataFrames

In [13]:
# Create a new set of data for the 2009 year with selected columns

mls_09_new_data = mls_09_data[['id', 'club', 'last_name', 'first_name']].copy()
mls_09_new_data.head()

   id club  last_name first_name
0   1   NE   Albright      Chris
1   2  RSL  Alexandre       Jean
2   3   DC      Allen        Ely
3   4  SEA     Alonso    Osvaldo
4   5   NE     Alston      Kevin

## Difference in Salary from 2007 to 2009

In [14]:
# For that, compute the average salary

## Connect to local Database

In [15]:
# Create the database then run SQL script to crate tables
rds_connection_string = "postgres:112524@localhost:5432/ETL_Project"
engine = create_engine(f'postgresql://{rds_connection_string}')

# Check for tables

In [16]:
engine.table_names()

['mls_salaries_2007', 'mls_salaries_2009']

## Use pandas to load csv converted DataFrames into database

In [20]:
mls_07_new_data.to_sql(name='mls_salaries_2007', con=engine, if_exists='append', index=False)

IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "mls_salaries_2007_pkey"
DETAIL:  Key (id)=(1) already exists.

[SQL: INSERT INTO mls_salaries_2007 (id, club, last_name, first_name) VALUES (%(id)s, %(club)s, %(last_name)s, %(first_name)s)]
[parameters: ({'id': 1, 'club': 'CHI', 'last_name': 'Armas', 'first_name': 'Chris'}, {'id': 2, 'club': 'CHI', 'last_name': 'Banner', 'first_name': 'Michael'}, {'id': 3, 'club': 'CHI', 'last_name': 'Barrett', 'first_name': 'Chad'}, {'id': 4, 'club': 'CHI', 'last_name': 'Blanco', 'first_name': 'Cuauhtemoc'}, {'id': 5, 'club': 'CHI', 'last_name': 'Brown', 'first_name': 'C.J.'}, {'id': 6, 'club': 'CHI', 'last_name': 'Busch', 'first_name': 'Jon'}, {'id': 7, 'club': 'CHI', 'last_name': 'Carr', 'first_name': 'Calen'}, {'id': 8, 'club': 'CHI', 'last_name': 'Conde', 'first_name': 'Wilman'}  ... displaying 10 of 371 total bound parameter sets ...  {'id': 370, 'club': 'TFC', 'last_name': 'Welsh', 'first_name': 'Andrew'}, {'id': 371, 'club': 'TFC', 'last_name': 'Wynne', 'first_name': 'Marvell'})]
(Background on this error at: http://sqlalche.me/e/13/gkpj)

## Use pandas to load csv converted DataFrames into database

In [ ]:
mls_09_new_data.to_sql(name='mls_salaries_2009', con=engine, if_exists='append', index=False)

## Confirm data has been added by querying the mls_salaries_2007 table

In [19]:
pd.read_sql_query('select * from mls_salaries_2007', con=engine).head()

   id club last_name  first_name postion  base_salary  guaranteed_compensation
0   1  CHI     Armas       Chris       M     225000.0                 225000.0
1   2  CHI    Banner     Michael       M      12900.0                  12900.0
2   3  CHI   Barrett        Chad       F      41212.5                  48712.5
3   4  CHI    Blanco  Cuauhtemoc       F    2492316.0                2666778.0
4   5  CHI     Brown        C.J.       D     106391.0                 106391.0